


#题1
'''
在这一个月，我们学了python基础，简单总结下，有六种数据类型，函数以及类。
(1)请从str，list,dict,set选出 1 种数据类型，进行归纳总结。
(2)请选择函数和类其中 1 种，进行归纳总结。
'''

#例  元组(tuple)
#1.可变不可变对象？序列还是非序列？
#2.操作元祖的方法有多少种，其中哪几个方法使用频率高，并选择1-3个方法进行代码展示
#3.是否可迭代
#4.索引和步长简单展示
#5.特殊的骚操作及用法
#开放题，想到多少写多少，可以通过回顾视频以及查资料的方法完成此题。
#以元祖为例，完成1.2.3即可拿到70%的分数。











#题2
'''
今天学习了正则表达式，请以所学的知识完成以下要求：
(1)请写出python的变量命名规则    
(2)'00\d'可以匹配 001,002,003等等，
   '\d\d\d'可以匹配010,999,998,666等三位数
    请写出一个正则表达式，它可以匹配python合法的变量名
'''












#题3
'''
请定义一个类(class),满足以下要求：
    1.这个类，必须含有字符串所有的方法。
    2.这个类有一个统计方法：
        统计输入字符串里，英文字母、空格、数字和其他字符分别出现次数，
        返回值为包含元祖的列表，格式如下：
        参数' hello  9'
        返回值：[('letter',5),('space',3),('num',1),('other',0)]
        (对返回值列表中元祖的顺序无要求)

'''


#题4
'''
猴子第一天摘下N个桃子，当时就吃了一半，还不过瘾，就又多吃了一个。第二天又将剩下的桃子吃掉一半，又多吃了一个。
以后每天都吃前一天剩下的一半零一个。
到第10天在想吃的时候就剩一个桃子了,
问第一天共摘下来多少个桃子？
(提示:递归函数)
'''





#题5
'''
请定义一个名为titles的函数：
    1.接收一句英文(字符串)作为参数
    2.将这个英文的每个单词转换成有且只有首字母大写的形式
    3.返回转换后的英文句
    4.str.title具有这个功能，但在此题不可使用str.title，请用自己的代码完成。
例如：
>>> titles('this is python.')
'This Is Python.'
>>> titles('i love python')
'I Love Python'
>>> 

'''





#题6
'''
现有一个列表，其中有10个元素，元素均为int类型，列表内的数据是无序。
现在要求我们通过编写一个程序将这列表变成一个从小到大排序的列表
请用自己的代码完成。
'''






#题7
'''
1.写一个猜数字的游戏，要求：系统生成一个随机数（1-10），用户输入数字去猜。
如果输入数 小了 或者 大了，都给于相应提示。如果输入数 与 随机数相等，就提示“ 恭喜您猜对了!”
'''


